In [22]:
import pandas as pd

data = pd.read_csv("C:/Users/Arjun/09_Data Analytics/data/company1.csv")
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [23]:
data.isnull()

    EEID   Name  gender  salary
0  False  False   False    True
1  False  False   False   False
2  False  False    True   False
3  False  False   False   False
4  False   True   False   False
5  False  False   False    True
6  False  False   False   False

In [24]:
data.isnull().sum()

EEID      0
Name      1
gender    1
salary    2
dtype: int64

In [25]:
print(data.dropna())

    EEID    Name gender   salary
1  EMP02   rohit      M  25000.0
3  EMP01  ayushi      F  20000.0
6  EMP02   rohit      M  25000.0

In [28]:
import numpy as np
print(data.replace(np.nan,"empty"))

    EEID      Name gender   salary
0  EMP01    ayushi      F    empty
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali  empty  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05     empty      M  25000.0
5  EMP06     rohit      M    empty
6  EMP02     rohit      M  25000.0